imHoangAnh/Project-II/sdkconfig.defaults
# Target Configuration
CONFIG_IDF_TARGET="esp32c6"

# ESP32C6-Specific
CONFIG_ESP32C6_DEFAULT_CPU_FREQ_160=y

# I2C Configuration
CONFIG_I2C_ENABLE_DEBUG_LOG=n

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000

# Component config
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition Table - Custom for larger app size (WiFi + MQTT)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Serial flasher config
CONFIG_ESPTOOLPY_BAUD_921600B=y

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Main task stack size (increased for WiFi and HTTP)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# WiFi Configuration
CONFIG_ESP_WIFI_SSID="Hoanganhh"
CONFIG_ESP_WIFI_PASSWORD="250303hanh"

# MQTT Configuration
CONFIG_MQTT_USE_THINGSBOARD=y
CONFIG_MQTT_BROKER_URI="mqtt://10.143.203.27:1883"
CONFIG_MQTT_THINGSBOARD_ACCESS_TOKEN="3x50jua1ah34f5r3kfrx"

# LWIP Configuration
CONFIG_LWIP_LOCAL_HOSTNAME="esp32-env-monitor"

# HTTP Server Configuration
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# NVS Configuration
CONFIG_NVS_ENCRYPTION=n
# NVS is enabled by default in ESP-IDF
# Default NVS partition size is sufficient for IAQ state persistence

# Power Management (optional - for energy saving)
# CONFIG_PM_ENABLE=y
# CONFIG_PM_DFS_INIT_AUTO=y
